app/controllers/entries_controller.rb

  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-08-03 01:06:37.993771"], ["updated_at", "2017-08-03 01:06:37.993771"]]

  def destroy
    @entry.destroy
---
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 1]]

  def set_entry
    @entry = Entry.find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]