app/controllers/properties_controller.rb

  def create
    if Property.create property_params
---
INSERT INTO "properties" ("address", "city", "state", "zip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "350 Simonis Squares"], ["city", "Hammesfort"], ["state", "Nebraska"], ["zip", "89700-5423"], ["created_at", "2017-08-01 00:58:49.330007"], ["updated_at", "2017-08-01 00:58:49.330007"]]

  def update
    if @property.update property_params
---
UPDATE "properties" SET "address" = ?, "city" = ?, "state" = ?, "zip" = ?, "updated_at" = ? WHERE "properties"."id" = ?  [["address", "79166 Schneider Road"], ["city", "Rodriguezville"], ["state", "South Carolina"], ["zip", "27569-5977"], ["updated_at", "2017-08-01 01:03:39.222902"], ["id", 1]]

  def destroy
    @property.destroy
---
DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 1]]

  def set_property
    @property = Property.find params[:id]
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]